tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "oven-sh/bun"
tap "superfly/tap"

brew "act"
brew "bat"
brew "btop"
brew "colima"
brew "ctop"
brew "direnv"
brew "doctl"
brew "dustinblackman/tap/oatmeal"
brew "entr"
brew "eza"
brew "fasd"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "firebase-cli"
brew "fizz"
brew "folly"
brew "fzf"
brew "gdal"
brew "geoip"
brew "geos"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "harfbuzz"
brew "hdf5"
brew "htop"
brew "hurl"
brew "jq"
brew "k1LoW/tap/tbls"
brew "libdap"
brew "libffi"
brew "libidn2"
brew "libmemcached"
brew "libslirp"
brew "libspatialite"
brew "lima"
brew "luajit"
brew "luv"
brew "mas"
brew "mcfly"
brew "mysql"
brew "mysql-client"
brew "navi"
brew "neovim"
brew "node"
brew "numpy"
brew "pango"
brew "pipx"
brew "pkgxdev/made/pkgx"
brew "podman"
brew "poppler"
brew "poppler-qt5"
brew "postgresql@14"
brew "python@3.9"
brew "qemu"
brew "qt@5"
brew "sampler"
brew "superfly/tap/flyctl"
brew "tldr"
brew "trash"
brew "trippy"
brew "walk"
brew "wangle"
brew "watchman"
brew "whalebrew"

cask "1password-cli"
cask "ngrok"
