# ==============================================================================
# HOMEBREW TAPS
# ==============================================================================

tap "1password/tap"
tap "dustinblackman/tap"
tap "homebrew/bundle"
tap "k1LoW/tap"
tap "oven-sh/bun"
tap "ramiawar/dataline"
tap "trycua/lume"  # Mac/Linux VM manager using macOS hypervisor


# ==============================================================================
# PACKAGE & VERSION MANAGERS
# ==============================================================================

# Mise - Modern asdf/vfox/direnv replacement
# Universal tool version manager and task runner
# https://mise.jdx.dev/installing-mise.html#homebrew
brew "mise"

# Note: The following are managed via mise instead of brew:
# - bun
# - neovim


# ==============================================================================
# CONTAINERS & VIRTUALIZATION
# ==============================================================================

# OrbStack - Docker Desktop replacement
# Fast, lightweight Docker & Linux VMs for macOS
# https://orbstack.dev/download
cask "orbstack"

# Colima - Container runtime for macOS
# Alternative lightweight container runtime
brew "colima"

# Lima - Linux virtual machines
# Simple VM management for macOS
# https://lima-vm.io
brew "lima"

# Podman - Daemonless container engine
# Docker alternative
brew "podman"

# QEMU - Generic machine emulator and virtualizer
brew "qemu"


# ==============================================================================
# TERMINALS
# ==============================================================================

# Ghostty - Modern GPU-accelerated terminal emulator
# https://ghostty.org/docs/install/binary#macos
cask "ghostty"

# WezTerm - GPU-accelerated cross-platform terminal emulator
# Highly configurable Rust-based terminal
# cask "wezterm"


# ==============================================================================
# GUI APPLICATIONS
# ==============================================================================

# Ice - Menu bar management tool
# Open-source Bartender replacement
# https://github.com/jordanbaird/Ice
cask "jordanbaird-ice"

# MarkEdit - Native markdown editor
# Fast, minimal Markdown editor for macOS
# https://github.com/MarkEdit-app/MarkEdit
cask "markedit"

# Ollamac - LLM server
# Local large language model server for macOS
cask "ollamac"

# Kegworks - Wine wrappers for Windows apps
# Run Windows applications on macOS
cask "gcenx/wine/kegworks", args: { no_quarantine: true }

# Alternative browsers (commented out for now)
# cask "eloston-chromium", args: { no_quarantine: true }  # Ungoogled Chromium
# cask "librewolf", args: { no_quarantine: true }        # Privacy-focused Firefox fork


# ==============================================================================
# VERSION CONTROL & GIT TOOLS
# ==============================================================================

# Git - Distributed version control system
brew "git"

# GitHub CLI - Official GitHub command-line tool
brew "gh"

# GHQ - Manage remote repository clones
# Clones repos into organized directory structure (e.g., ~/src/github.com/org/repo)
brew "ghq"

# Difftastic - Structural diff tool
# Syntax-aware diffing for better change visualization
# https://difftastic.wilfred.me.uk
brew "difftastic"

# Git Delta - Enhanced diff viewer
# Syntax-highlighted pager for git, diff, and grep output
brew "git-delta"


# ==============================================================================
# TEXT & DATA PROCESSING
# ==============================================================================

# JQ - Command-line JSON processor
# The essential JSON query and manipulation tool
brew "jq"

# IJQ - Interactive JQ
# Terminal UI for exploring and experimenting with jq
brew "ijq"

# Dasel - Data selector and format converter
# Query and modify JSON, YAML, TOML, XML, CSV with unified syntax
# https://daseldocs.tomwright.me/installation
brew "dasel"

# Miller - Like awk, sed, cut, join, and sort for data formats
# Process CSV, TSV, JSON, and more with SQL-like syntax
brew "miller"

# Sad - Space-age sed
# Batch file editing with preview and safety features
# https://github.com/ms-jpq/sad
brew "sad"


# ==============================================================================
# SYSTEM MONITORING & PERFORMANCE
# ==============================================================================

# Btop - Resource monitor
# Beautiful and feature-rich system monitor (C++ rewrite of bpytop)
brew "btop"

# Bottom - System monitor
# Cross-platform graphical process/system monitor
# https://github.com/ClementTsang/bottom#installation
brew "bottom"

# Htop - Interactive process viewer
# Classic improved alternative to top
brew "htop"

# Ctop - Container metrics and monitoring
# Top-like interface for container metrics
brew "ctop"

# DUA - Disk Usage Analyzer
# Fast disk space analyzer with cleanup capabilities
brew "dua-cli"


# ==============================================================================
# ENHANCED CLI REPLACEMENTS
# ==============================================================================

# Bat - Cat with syntax highlighting and git integration
brew "bat"

# Eza - Modern ls replacement
# Feature-rich ls alternative with colors, icons, and git awareness
brew "eza"

# Fd - Fast and user-friendly find alternative
brew "fd"

# Ripgrep - Fast recursive grep
# Lightning-fast search tool respecting .gitignore
brew "ripgrep"

# FZF - Fuzzy finder
# Command-line fuzzy finder for files, history, processes, etc.
brew "fzf"

# FASD - Fast directory switching
# Quick access to frequently used files and directories (z.sh replacement)
brew "fasd"

# Trash - Safe rm replacement
# Move files to trash instead of permanent deletion
brew "trash"

# Walk - Interactive directory tree tool
# Terminal file manager with tree view
brew "walk"


# ==============================================================================
# NETWORK TOOLS
# ==============================================================================

# Dog - Enhanced dig
# Modern DNS client with colorful output
brew "dog"

# Doggo - DNS client
# Modern command-line DNS client
# https://doggo.mrkaran.dev/docs/intro/installation/
brew "doggo"

# Gping - Ping with graphs
# Visual ping tool with real-time charts
brew "gping"

# Trippy - Network diagnostic tool
# Advanced traceroute and network diagnostics
# https://trippy.cli.rs
brew "trippy"

# ngrok - Local tunnel creation
# Expose local servers to the internet for testing
cask "ngrok"

# Cloudflared - Cloudflare Zero Trust tunnels
# Create secure tunnels to origin servers
brew "cloudflared"

# DOctl - DigitalOcean CLI
# Official DigitalOcean command-line client
brew "doctl"

# Rclone - Cloud storage sync
# Sync files to/from cloud storage providers
# https://rclone.org/install/#macos-brew
brew "rclone"

# Siege - HTTP load testing
# HTTP regression testing and benchmarking utility
# https://github.com/JoeDog/siege
brew "siege"


# ==============================================================================
# DEVELOPMENT TOOLS
# ==============================================================================

# Starship - Cross-shell prompt
# Fast, customizable prompt for any shell
brew "starship"

# Helix - Post-modern modal text editor
# Rust-based modal editor with built-in LSP support
# https://docs.helix-editor.com/install.html#macos
brew "helix"

# Entr - Run commands on file changes
# File watcher that executes commands when files change
brew "entr"

# Hyperfine - Command-line benchmarking tool
# Statistical benchmarking for command execution
brew "hyperfine"

# Hurl - HTTP testing tool
# Test HTTP requests defined in simple text files
brew "hurl"

# Act - Run GitHub Actions locally
# Test GitHub Actions workflows on your machine
brew "act"

# Whalebrew - Homebrew for Docker images
# Run Docker images as if they were native commands
brew "whalebrew"

# Watchman - File watching service
# Efficient file change monitoring (used by React Native, Jest, etc.)
brew "watchman"

# Grex - Regular expression generator
# Generate regex patterns from test cases
brew "grex"


# ==============================================================================
# DATABASES
# ==============================================================================

# MySQL - Open-source relational database
brew "mysql"

# MySQL Client - MySQL client libraries and tools
brew "mysql-client"

# TBLS - Database documentation tool
# Automatic schema documentation generator
brew "k1LoW/tap/tbls"

# Redis GUI
# https://github.com/vicanso/zedis
cask "zedis"

# ==============================================================================
# MEDIA TOOLS
# ==============================================================================

# FFmpeg - Multimedia framework
# Record, convert, and stream audio/video
brew "ffmpeg"

# Chafa - Terminal image viewer
# Display images in the terminal with high quality
brew "chafa"


# ==============================================================================
# SECURITY & AUTHENTICATION
# ==============================================================================

# 1Password CLI - Command-line password manager
# Secure credential management from the terminal
cask "1password-cli"

# GnuPG - Encryption and signing tool
# OpenPGP implementation for secure communication
brew "gnupg"


# ==============================================================================
# DOCUMENTATION & HELP
# ==============================================================================

# Navi - Interactive cheatsheet tool
# Browse and execute command-line snippets
brew "navi"

# Tealdeer - Fast tldr client
# Simplified man pages with practical examples
# https://tealdeer-rs.github.io/tealdeer/installing.html
brew "tealdeer"


# ==============================================================================
# PRODUCTIVITY & UTILITIES
# ==============================================================================

# Atuin - Enhanced shell history
# Searchable, encrypted shell history sync
# https://github.com/atuinsh/atuin
brew "atuin"

# McFly - Better terminal history
# Neural network-powered command history search
brew "mcfly"

# Dataline - Data visualization tool
brew "dataline"

# PV - Pipe Viewer
# Monitor data progress through Unix pipes
# http://www.ivarch.com/programs/pv.shtml
brew "pv"

# Pastel - Color manipulation tool
# Generate, analyze, and manipulate colors from the command line
brew "pastel"

# MAS - Mac App Store CLI
# Install and update Mac App Store apps from the command line
brew "mas"

# Groff - GNU troff text formatter
# Required by AWS CLI and other tools
brew "groff"


# ==============================================================================
# LIBRARIES & DEPENDENCIES
# ==============================================================================

# Facebook/Meta libraries
brew "fb303"
brew "fbthrift"
brew "fizz"
brew "folly"
brew "wangle"

# Geographic/spatial libraries
brew "gdal"
brew "geoip"
brew "geos"
brew "libspatialite"

# Core libraries
brew "glib"
brew "gnutls"
brew "harfbuzz"
brew "hdf5"
brew "libdap"
brew "libffi"
brew "libidn2"
brew "libmemcached"
brew "libslirp"

# Lua libraries
brew "luajit"
brew "luv"  # libuv bindings for Lua

# Qt framework
brew "qt@5"


# ==============================================================================
# MAC APP STORE APPLICATIONS (Commented Out)
# ==============================================================================
# Uncomment the apps you want to install from the Mac App Store
# Use 'mas search "app name"' to find app IDs
#
# mas "1Password for Safari"
# mas "About"
# mas "Bitwarden"
# mas "Boop"
# mas "Button Creator"
# mas "Byword"
# mas "Calca"
# mas "CotEditor"
# mas "CrystalClear Switcher"
# mas "DaisyDisk"
# mas "Darkroom"
# mas "Deliveries"
# mas "Dice"
# mas "Downlink"
# mas "Drafts"
# mas "Due"
# mas "Figr"
# mas "Flighty"
# mas "Flow"
# mas "GarageBand"
# mas "Gifski"
# mas "Hand Mirror"
# mas "HomeBot"
# mas "HomeControl"
# mas "Hush"
# mas "Ice Cubes"
# mas "Kagi Search"
# mas "Keynote"
# mas "Little Snitch Mini"
# mas "Mic Drop"
# mas "Mini Metro+"
# mas "Mini Motorways"
# mas "Name Mangler"
# mas "Noizio"
# mas "Numbers"
# mas "Omnivore"
# mas "PCalc"
# mas "Pages"
# mas "Parcel"
# mas "PiPifier"
# mas "Pixelmator Pro"
# mas "Poolsuite FM"
# mas "Save to Raindrop.io"
# mas "Shortery"
# mas "Soulver 2"
# mas "Speedtest"
# mas "Swift Playground"
# mas "TestFlight"
# mas "Things"
# mas "Todoist"
# mas "Tomato 2"
# mas "Tomito"
# mas "Tot"
# mas "Turnip Timer"
# mas "Weathergraph"
# mas "Xcode"
# mas "fullmoon"
# mas "iMovie"
