tap "1password/tap"
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "ramiawar/dataline"
tap "superfly/tap"
tap "version-fox/tap"

# V-fox https://vfox.lhan.me/guides/quick-start.html
brew "vfox"

cask "1password-cli"
brew "dataline"
cask "ngrok"
cask "wezterm"

# github actions runner
brew "act"
# improved cat
brew "bat"
# json viewer / processor: https://fx.wtf
brew "fx"
# improvted top
brew "btop"
# terminal image viewer
brew "chafa"
brew "colima"
brew "ctop"
# loads envrc and .env files automatically when entering a directory
brew "direnv"
brew "doctl"
# oatmeal is an llm interface
brew "dustinblackman/tap/oatmeal"
# enhanced dig
brew "dog"
# DNS client https://doggo.mrkaran.dev/docs/intro/installation/
brew "doggo"
# disk space analyzer and rm helper
brew "dua-cli"
brew "entr"
# enhanced ls
brew "eza"
# "z.sh" replacement for fast directory switching
brew "fasd"
brew "fb303"
brew "fbthrift"
# enhanced find
brew "fd"
brew "firebase-cli"
brew "fizz"
brew "folly"
# FZF, fuzzy list filtering
brew "fzf"
brew "gdal"
brew "geoip"
brew "geos"
# github cli
brew "gh"
# install/clone git repos similarly to `go get`. eg, will clone to `~/src/github.com/org/reponame`
brew "ghq"
brew "git"
# syntactical diffing: https://difftastic.wilfred.me.uk
brew "difftastic"
# enhanced diff
brew "git-delta"
brew "glib"
brew "gnupg"
brew "gnutls"
# ping, with charts
brew "gping"
# regex helper/constructor
brew "grex"
brew "harfbuzz"
brew "hdf5"
# helix modal editor: https://docs.helix-editor.com/install.html#macos
brew "helix"
# improvted top
brew "htop"
# file based curl thingy
brew "hurl"
# benchmarking util
brew "hyperfine"
# interactive jq
brew "ijq"
# json filtering
brew "jq"
# Schema introspection
brew "k1LoW/tap/tbls"
brew "libdap"
brew "libffi"
brew "libidn2"
brew "libmemcached"
brew "libslirp"
brew "libspatialite"
brew "lima"
brew "luajit"
brew "luv"
# mac app store cli
brew "mas"
# better terminal history
brew "mcfly"
# sed/cut/awk/etc
brew "miller"
brew "mysql"
brew "mysql-client"
# interactive cheatsheet for cli commands
brew "navi"
brew "neovim"
# colors! find/change/modify/etc
brew "pastel"
brew "pipx"
brew "pkgxdev/made/pkgx"
brew "podman"
# https://rclone.org/install/#macos-brew
brew "rclone"
brew "ripgrep"
brew "qemu"
brew "qt@5"
# spaceage sed https://github.com/ms-jpq/sad
brew "sad"
# fly.io cli
brew "superfly/tap/flyctl"
brew "tldr"
brew "trash"
brew "trippy"
# interactive directory tree tool
brew "walk"
brew "wangle"
brew "watchman"
brew "whalebrew"

# quicklook plugins

# provisioning certificates
cask "provisionql"

cask "syntax-highlight"
cask "qlstephen"

cask "betterzip"
cask "quicklook-json"
