{
  "Brewfile.vim": { "branch": "master" },
  "avante.nvim": { "branch": "main" },
  "blayu.vim": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "cmd-parser.nvim": { "branch": "master" },
  "codecompanion.nvim": { "branch": "main" },
  "comment-box.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "falcon": { "branch": "master" },
  "fastaction.nvim": { "branch": "main" },
  "fidget.nvim": { "branch": "main" },
  "flash.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "fzf-lua": { "branch": "main" },
  "git-conflict.nvim": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "guihua.lua": { "branch": "master" },
  "iceberg.vim": { "branch": "master" },
  "improved-search.nvim": { "branch": "main" },
  "iswap.nvim": { "branch": "master" },
  "jot.lua": { "branch": "master" },
  "kubectl.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "mcphub.nvim": { "branch": "main" },
  "minuet-ai.nvim": { "branch": "main" },
  "molokai": { "branch": "master" },
  "move.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neogit": { "branch": "master" },
  "night-owl.vim": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
  "nvim-aider": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-faker": { "branch": "main" },
  "nvim-jsonnet": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-rulebook": { "branch": "main" },
  "nvim-spectre": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "oatmeal.nvim": { "branch": "master" },
  "oceanic-next": { "branch": "master" },
  "octo.nvim": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "ollama.nvim": { "branch": "main" },
  "package-info.nvim": { "branch": "master" },
  "pendulum-nvim": { "branch": "main" },
  "pkl-neovim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "range-highlight.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
  "sad.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "sllm.nvim": { "branch": "main" },
  "smart-splits.nvim": { "branch": "master" },
  "snacks.nvim": { "branch": "main" },
  "spaceduck": { "branch": "main" },
  "sqlite.nvim": { "branch": "master" },
  "srcery-vim": { "branch": "master" },
  "switch.vim": { "branch": "main" },
  "template-string.nvim": { "branch": "main" },
  "time-tracker.nvim": { "branch": "master" },
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
  "todo-comments.nvim": { "branch": "main" },
  "tokyonight": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "ts-comments.nvim": { "branch": "main" },
  "tsc.nvim": { "branch": "main" },
  "twoslash-queries.nvim": { "branch": "main" },
  "undotree": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-brogrammer-theme": { "branch": "main" },
  "vim-characterize": { "branch": "master" },
  "vim-colors-plain": { "branch": "master" },
  "vim-colors-solarized": { "branch": "master" },
  "vim-convert-color-to": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-monokai-pro": { "branch": "master" },
  "vim-pink-moon": { "branch": "master" },
  "vim-prisma": { "branch": "main" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-rsi": { "branch": "master" },
  "vim-speeddating": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" },
  "wezterm-types": { "branch": "main" },
  "which-key.nvim": { "branch": "main" },
  "zippy.nvim": { "branch": "master" }
}
