{
  "plugins": {
    "blink.cmp": {
      "version": "1.0.0 - 2.0.0"
    },
    "command.nvim": [],
    "fastaction.nvim": [],
    "fidget.nvim": {
    },
    "friendly-snippets": [],
    "fzf-lua": {
    },
    "gitsigns.nvim": {
    },
    "grug-far.nvim": {
    },
    "hop.nvim": [],
    "iswap.nvim": [],
    "lazydev.nvim": {
    },
    "lualine.nvim": {
    },
    "minuet-ai.nvim": {
    },
    "nui.nvim": [],
    "nvim-autopairs": {
    },
    "nvim-chainsaw": {
    },
    "nvim-lspconfig": {
    },
    "nvim-surround": {
    },
    "nvim-treesitter": [],
    "nvim-ts-autotag": [],
    "nvim-web-devicons": {
    },
    "plenary.nvim": [],
    "render-markdown.nvim": {
    },
    "schemastore.nvim": {
    },
    "smart-splits.nvim": {
    },
    "switch.vim": [],
    "template-string.nvim": [],
    "todo-comments.nvim": {
    },
    "tokyonight.nvim": {
    },
    "tsc.nvim": [],
    "twoslash-queries.nvim": {
    },
    "undotree": {
    },
    "vim-abolish": [],
    "vim-characterize": [],
    "vim-fugitive": [],
    "vim-repeat": [],
    "vim-rsi": [],
    "vim-speeddating": [],
    "vim-unimpaired": [],
    "wezterm-types": {
    },
    "wtf.nvim": {
    }
  }
}